Reports/СправкаРасчетСписаниеРБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>СправкаРасчетСписаниеРБП</Name>
			<Comment>(регл)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Comment>1 - БУ, 2 - НУ, 3 - БУ, ПР, ВР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраняемыеРеквизиты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИнуюНастройку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РасчетСписанияРБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РасчетСписанияРБП</Name>
			<Comment>Расчет списания расходов будущих периодов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачОстатокНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонОстатокНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасходыБудущихПериодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/СправкаРасчетСписаниеРБП/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
	Перем НП Экспорт;
	
Функция СформироватьТекстЗапроса()
	
	Текст	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетСписанияРБП.ПериодРасчета КАК Период,
	|	РасчетСписанияРБП.Статья КАК Статья,
	|	РасчетСписанияРБП.СчетУчета КАК СчетУчета,
	|	РасчетСписанияРБП.СчетСписания КАК СчетСписания,
	|	РасчетСписанияРБП.ДатаНачала КАК ДатаНачала,
	|	РасчетСписанияРБП.ДатаОкончания КАК ДатаОкончания,
	|	ЕСТЬNULL(РасчетСписанияРБП.НачОстаток, 0) КАК НачОстаток,
	|	ЕСТЬNULL(РасчетСписанияРБП.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(РасчетСписанияРБП.КонОстаток, 0) КАК КонОстаток,
	|	ЕСТЬNULL(РасчетСписанияРБП.НачОстатокНУ, 0) КАК НачОстатокНУ,
	|	ЕСТЬNULL(РасчетСписанияРБП.СуммаНУ, 0) КАК СуммаНУ,
	|	ЕСТЬNULL(РасчетСписанияРБП.КонОстатокНУ, 0) КАК КонОстатокНУ
	|ИЗ
	|	РегистрСведений.РасчетСписанияРБП КАК РасчетСписанияРБП
	|ГДЕ
	|	РасчетСписанияРБП.ПериодРасчета МЕЖДУ &ДатаНач И &ДатаКон
	|	И РасчетСписанияРБП.Организация = &Организация
	|	И РасчетСписанияРБП.Активность
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Статья
	|ИТОГИ
	|	СУММА(НачОстаток),
	|	СУММА(Сумма),
	|	СУММА(КонОстаток),
	|	СУММА(НачОстатокНУ),
	|	СУММА(СуммаНУ),
	|	СУММА(КонОстатокНУ)
	|ПО
	|	Период,
	|	Статья";
	
	Возврат Текст;
	
КонецФункции
	
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь, НачалоПодписи, ПоказыватьПодписи) Экспорт
	
	НачалоПериода = НачалоДня(ДатаНач);
	КонецПериода  = КонецДня(ДатаКон);
	
	ДокументРезультат.Очистить();
	
	Макет      = ПолучитьМакет("Отчет");
	// 37490 <<
	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
	МакетОбщий = ПолучитьОбщийМакет("СправкаРасчет");
	// 37490 <<
	МакетОбщий.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
	
	ЗаголовокОтчета = МакетОбщий.ПолучитьОбласть("Заголовок");
	
	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;
	
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ЗатратыБудущихПериодов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач",     НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаКон",     КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ОграниченияПоПостроителюОтчета = БухгалтерскиеОтчеты.ПолучитьТекстОграниченийПоПостроителюОтчета(ПостроительОтчета, Запрос);
	
	Если Не ПустаяСтрока(ОграниченияПоПостроителюОтчета) Тогда
		
		ОграниченияПоПостроителюОтчета = " И " + ОграниченияПоПостроителюОтчета;
		ОграниченияПоПостроителюОтчета = СтрЗаменить(ОграниченияПоПостроителюОтчета, "Субконто1", "Статья");
		
	КонецЕсли;
	
	Запрос.Текст = СформироватьТекстЗапроса();
	
	Запрос.Текст  = СтрЗаменить(Запрос.Текст, "И РасчетСписанияРБП.Активность","И РасчетСписанияРБП.Активность " + ОграниченияПоПостроителюОтчета);
	
	Результат = Запрос.Выполнить();
	
	НеУдалосьПолучитьУчетнаюПолитику = Ложь;
	УчетнаяПолитика = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(ДатаНач, НеУдалосьПолучитьУчетнаюПолитику, Организация, "Нал");
	
	Если НеУдалосьПолучитьУчетнаюПолитику Тогда
		ПлательщикНалогаНаПрибыль = Ложь;
	Иначе
		ПлательщикНалогаНаПрибыль = УчетнаяПолитика.ЕстьНалогНаПрибыль;
	КонецЕсли;
	
	ОбластьШапка            = Макет.ПолучитьОбласть("Шапка"+?(НЕ ПлательщикНалогаНаПрибыль,"|ТолькоБУ",""));
	ОбластьСтрокаЗатрат     = Макет.ПолучитьОбласть("СтрокаЗатрат"+?(НЕ ПлательщикНалогаНаПрибыль,"|ТолькоБУ",""));
	ОбластьИтого            = Макет.ПолучитьОбласть("Итого"+?(НЕ ПлательщикНалогаНаПрибыль,"|ТолькоБУ",""));
	ОбластьОкончаниеТаблицы = Макет.ПолучитьОбласть("ОкончаниеТаблицы"+?(НЕ ПлательщикНалогаНаПрибыль,"|ТолькоБУ",""));
	ОбластьПодвал             = МакетОбщий.ПолучитьОбласть("Подвал");
	
	ВыборкаПериод = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПериод.Следующий() Цикл
		
		ЗаголовокОтчета.Параметры.Период              = "" + ПредставлениеПериода(НачалоМесяца(ВыборкаПериод.Период), КонецМесяца(ВыборкаПериод.Период), "Л="+Локализация.ОпределитьКодЯзыкаДляФормат(Локализация.КодЯзыкаИнтерфейса())+"; ФП = Истина");
		ЗаголовокОтчета.Параметры.НазваниеОрганизации = "" + Организация.НаименованиеПолное;
		ЗаголовокОтчета.Параметры.ДатаСоставления     = КонецМесяца(ВыборкаПериод.Период);
		ЗаголовокОтчета.Параметры.НазваниеОтчета      = НСтр("ru='Списание расходов будущих периодов';uk='Списання витрат майбутніх періодів'", КодЯзыкаПечать);
		ДокументРезультат.Вывести(ЗаголовокОтчета);
		
		СтрОтбор = УправлениеОтчетами.СформироватьСтрокуОтборов(ПостроительОтчета.Отбор);
		Если Не ПустаяСтрока(СтрОтбор) Тогда
			ОбластьОтбор = МакетОбщий.ПолучитьОбласть("СтрокаОтбор");
			ОбластьОтбор.Параметры.ТекстПроОтбор = НСтр("ru='Отбор: ';uk='Відбір: '", КодЯзыкаПечать) + СтрОтбор;
			ДокументРезультат.Вывести(ОбластьОтбор);
		КонецЕсли;
		
		// Параметр для показа заголовка
		ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
		
		ДокументРезультат.Вывести(ОбластьШапка);
		ВыборкаСтатья = ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСтатья.Следующий() Цикл
			
			НачОстаток   = ВыборкаСтатья.НачОстаток;
			Сумма        = ВыборкаСтатья.Сумма;
			КонОстаток   = ВыборкаСтатья.КонОстаток;
			Если ПлательщикНалогаНаПрибыль Тогда
				НачОстатокНУ = ВыборкаСтатья.НачОстатокНУ;
				СуммаНУ      = ВыборкаСтатья.СуммаНУ;
				КонОстатокНУ = ВыборкаСтатья.КонОстатокНУ;
			КонецЕсли;
			
			Выборка = ВыборкаСтатья.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ОбластьСтрокаЗатрат.Параметры.Статья = Выборка.Статья;
				ОбластьСтрокаЗатрат.Параметры.СчетУчета = Выборка.СчетУчета;
				ОбластьСтрокаЗатрат.Параметры.СчетСписания = Выборка.СчетСписания;
				ОбластьСтрокаЗатрат.Параметры.Аналитика1 = Выборка.Статья.СубконтоБУ1;
				ОбластьСтрокаЗатрат.Параметры.Аналитика2 = Выборка.Статья.СубконтоБУ2;
				ОбластьСтрокаЗатрат.Параметры.Аналитика3 = Выборка.Статья.СубконтоБУ3;
				
				
				ОбластьСтрокаЗатрат.Параметры.ДатаНачала = Формат(Выборка.ДатаНачала, "ДЛФ=D");
				ОбластьСтрокаЗатрат.Параметры.ДатаОкончания = Формат(Выборка.ДатаОкончания, "ДЛФ=D");
				ОбластьСтрокаЗатрат.Параметры.НачОст   = НачОстаток;
				ОбластьСтрокаЗатрат.Параметры.КонОст   = КонОстаток;
				ОбластьСтрокаЗатрат.Параметры.Сумма    = Сумма;
				Если ПлательщикНалогаНаПрибыль Тогда
					ОбластьСтрокаЗатрат.Параметры.НачОстНУ = НачОстатокНУ;
					ОбластьСтрокаЗатрат.Параметры.КонОстНУ = КонОстатокНУ;
					ОбластьСтрокаЗатрат.Параметры.СуммаНУ  = СуммаНУ;
				КонецЕсли;
				ДокументРезультат.Вывести(ОбластьСтрокаЗатрат);
				Прервать;
				
			КонецЦикла;  // 
			
		КонецЦикла;  // Статья
		
		
		ОбластьИтого.Параметры.ИтогоНачОст   = ВыборкаПериод.НачОстаток;
		ОбластьИтого.Параметры.ИтогоКонОст   = ВыборкаПериод.КонОстаток;
		ОбластьИтого.Параметры.ИтогоСумма    = ВыборкаПериод.Сумма;
		Если ПлательщикНалогаНаПрибыль Тогда
			ОбластьИтого.Параметры.ИтогоНачОстНУ = ВыборкаПериод.НачОстатокНУ;
			ОбластьИтого.Параметры.ИтогоКонОстНУ = ВыборкаПериод.КонОстатокНУ;
			ОбластьИтого.Параметры.ИтогоСуммаНУ  = ВыборкаПериод.СуммаНУ;
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьИтого);
		
		ДокументРезультат.Вывести(ОбластьОкончаниеТаблицы);
		
		ОбластьПодвал.Параметры.ТекстПримечания = ?(ВариантОтчета = 3, НСтр("ru='ПР: Постоянные разницы в оценке стоимости активов и обязательств. ВР: Временные разницы в оценке стоимости активов и обязательств.';uk=""ПР: Постійні різниці в оцінці вартості активів і зобов'язань. ТР: Тимчасові різниці в оцінці вартості активів і зобов'язань.""", КодЯзыкаПечать), "");
		
		ДокументРезультат.Вывести(ОбластьПодвал);
		
		ВысотаПодписи = ДокументРезультат.Области.Подвал.Низ - ДокументРезультат.Области.Подвал.Верх;
		
		ДокументРезультат.Области.Подвал.Видимость = ПоказыватьПодписи;
		
	КонецЦикла;    // Период	
	
	// Зафиксируем заголовок отчета
	//	ДокументРезультат.ФиксацияСверху = ВысотаЗаголовка + 1;
	
	// Первую колонку не печатаем
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
	
	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = НСтр("ru='Списание расходов будущих периодов';uk='Списання витрат майбутніх періодів'", КодЯзыкаПечать);
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(ДокументРезультат, ЗаголовокОтчета, Строка(глЗначениеПеременной("глТекущийПользователь")));
	
КонецПроцедуры // СформироватьОтчет
	
	
	////////////////////////////////////////////////////////////////////////////////
	// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
	// 
	
	НП = Новый НастройкаПериода;
	
#КонецЕсли
